Revit 2026 API

# PolyLine Methods

---

The PolyLine type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Clone | Returns a copy of this polyline. |
|  | Create |  |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified Object is equal to the current Object. (Inherited from GeometryObject) |
|  | Evaluate | Evaluates a parameter on the polyline. |
|  | GetCoordinate | Gets the coordinate point of the specified index. |
|  | GetCoordinates | Gets the coordinate points of the polyline. |
|  | GetHashCode | Gets the integer value of the geometry object as hash code (Inherited from GeometryObject) |
|  | GetOutline | Gets the outline of the polyline. |
|  | GetTransformed | Gets the copy of the polyline which is applied the specified transformation. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

PolyLine Class

Autodesk.Revit.DB Namespace